{
  "_position_embedding_type": "absolute",
  "architectures": [
    "MarkupLMForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "benign",
    "1": "phish"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "benign": 0,
    "phish": 1
  },
  "layer_norm_eps": 1e-05,
  "max_depth": 50,
  "max_position_embeddings": 514,
  "max_xpath_subs_unit_embeddings": 1024,
  "max_xpath_tag_unit_embeddings": 256,
  "model_type": "markuplm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "subs_pad_id": 1001,
  "tag_pad_id": 216,
  "transformers_version": "4.56.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50267,
  "xpath_unit_hidden_size": 32
}
